# Update Homebrew (optional, not needed in Brewfile)
brew "update"

# Command-line utilities
brew "vim"
brew "zsh"

# App deployment utilities
brew "flyctl" # Fly.io deployment for power-flow-analysis app
brew "render" # Render CLI for truckin' along app

# A better ack/grep
brew "the_silver_searcher"

# A terminal multiplexer
brew "tmux"

# So copy/paste works in tmux
brew "reattach-to-user-namespace"

# Ruby version manager
brew "rbenv"

# So `ruby install` works
brew "ruby-build"

# Command correction
brew "thefuck"

# Cask applications (GUI apps)
cask "bitwarden"
cask "discord"
cask "docker"
cask "iterm2"
cask "visual-studio-code"
